src/cfe/Kyporos.УправлениеДоступомПользователей/src/InformationRegisters/КП_ПараметрыСистемыУправленияДоступомПользователей/КП_ПараметрыСистемыУправленияДоступомПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КП_ПараметрыСистемыУправленияДоступомПользователей</name>
  <resources>
    <name>VKTeams_АдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>VKTeams_ИспользоватьУведомления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>VKTeams_ТокенБота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>VKTeams_ЧатИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресВебСервисаКупорос</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пользователь1СДляВебСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пароль1СДляВебСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИД_ТекущейСистемы</name>
    <comment>Должен быть уникальным в рамках одной сети</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтключатьПользователейДобавленныхВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьДопВариантПоискаПоФИО</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалятьПраваПользователей</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
</mdclass:InformationRegister>

src/cfe/Kyporos.УправлениеДоступомПользователей/src/CommonModules/КП_ОбменДаннымиКупорос/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ОБМЕНА ДАННЫМИ С КУПОРОС
//	- в программном интерфейсе регламентные задания, которые обращаются к центральной 1С:Купорос
//	- в служебном программном интерфейсе все вызовы операций веб-сервиса AccessControl 
//  
////////////////////////////////////////////////////////////////////////////////


#Область ПрограммныйИнтерфейс

// Регламентное задание. Загрузка в справочник КП_ПользователиТекущейИС
Процедура ФормированиеАктуальногоСпискаПользователейТекущийИС() Экспорт
	
	// Получение таблицы актуальных пользователей от Купорос
	ТаблицаАктуальныхПользователей = ЗагрузкаАктуальныхПользователейИзКупорос();
	
	КП_УправлениеПравамиДоступа.АктуализацияПользователейТекущейИС(ТаблицаАктуальныхПользователей);

КонецПроцедуры 

// Регламентное задание. Передача актуальных шаблонов доступа
Процедура ОбработкаВыгрузкиАктуальныхШаблоновДоступа() Экспорт

	КП_УправлениеПравамиДоступа.ОбновлениеШаблоновДоступа();	
	
	УспешноВыгрузились = ВыгрузкаШаблоновДоступаВКупорос();
	
КонецПроцедуры 

// Регламентное задание. Загрузка прав доступа для обработки
//
Процедура ОбработкаЗагрузкаПравДоступа() Экспорт

	ТаблицаПравПользователейДляОбновления = ЗагрузкаПравДоступаИзКупорос();	
	
	Если ТаблицаПравПользователейДляОбновления.Количество() > 0 Тогда
	
		КП_УправлениеПравамиДоступа.ЗагрузкаПравДоступа(ТаблицаПравПользователейДляОбновления);
	
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Вызов операции Ping. Базовая проверка подключения к Купорос
// 
// Возвращаемое значение:
//  Булево - Истина, если соединение успешно
//
Функция ПроверкаПодключенияККупорос() Экспорт

	ПараметрыПодключения = ПодключениеAccessControl();
		
	Прокси = ПараметрыПодключения.Прокси;
	
	Возврат Прокси.Ping();
	
КонецФункции // ПроверкаПодключенияККупорос()

// Вызов операции Version. Получение актуальной версии Купорос
// 
// Возвращаемое значение:
//  Строка - Новая версия из Купорос
//
Функция НоваяВерсия() Экспорт

	ПараметрыПодключения = ПодключениеAccessControl();
		
	Прокси = ПараметрыПодключения.Прокси;
	
	Возврат Прокси.Version();
	
КонецФункции // ПроверкаПодключенияККупорос()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область УниверсальныеОбработкиОбмена

// Возвращает результат подключения к Access control
// 
// Возвращаемое значение:
//  Структура - содержит свойства:
//		* ИД_ТекущейСистемы - Строка - идентификатор текущей системы
//		* Прокси - WSПрокси - веб-сервис для вызова операций
//
Функция ПодключениеAccessControl()
	
	ДанныеРезультатаПодключения = Новый Структура;
	ДанныеРезультатаПодключения.Вставить("ИД_ТекущейСистемы", "");
	ДанныеРезультатаПодключения.Вставить("Прокси", "");
	
	ПараметрыПодсистемы = РегистрыСведений.КП_ПараметрыСистемыУправленияДоступомПользователей.Параметры();
		
	ИД_ТекущейСистемы = ПараметрыПодсистемы.ИД_ТекущейСистемы;
	АдресВебСервисаКупорос = ПараметрыПодсистемы.АдресВебСервисаКупорос;
	Пользователь1С = ПараметрыПодсистемы.Пользователь1СДляВебСервиса;
	Пароль1С = ПараметрыПодсистемы.Пароль1СДляВебСервиса;
	
	
	ДанныеРезультатаПодключения.ИД_ТекущейСистемы = ИД_ТекущейСистемы;
	
	Таймаут = 60;
	SSL = Новый ЗащищенноеСоединениеOpenSSL;
	
	Определение = Новый WSОпределения(АдресВебСервисаКупорос, Пользователь1С, Пароль1С,, Таймаут, SSL);
    Прокси = Новый WSПрокси(Определение, ПространствоИмен(), "AccessControl", "AccessControlSoap",, Таймаут);       
	Прокси.Пользователь = Пользователь1С;
	Прокси.Пароль = Пароль1С;
	
	ДанныеРезультатаПодключения.Прокси = Прокси;
	
	Возврат ДанныеРезультатаПодключения;

КонецФункции

// Возвращает локальное пространство имен web-сервиса.
// 
// Возвращаемое значение:
//  Строка - Пространство имен.
//
Функция ПространствоИмен()

	Возврат "https://kpkrs.site/AccessControl";

КонецФункции // ПространствоИмен()

// Возвращает тип XDTO внутреннего пространства имен по имени типа.
//
// Параметры:
//  ИмяТипа	- Строка - Имя типа.
//
// Возвращаемое значение:
//	ТипXDTO
//
Функция ТипXDTO(ИмяТипа)

	Возврат ФабрикаXDTO.Тип(ПространствоИмен(), ИмяТипа);

КонецФункции // ТипXDTO

// Создаёт объект XDTO внутреннего пространства имен по имени типа.
//
// Параметры:
//  ИмяТипа	- Строка - Имя типа нового объекта XDTO.
//
// Возвращаемое значение:
//	ОбъектXDTO
//
Функция НовыйОбъектXDTO(ИмяТипа)

	Возврат ФабрикаXDTO.Создать(ТипXDTO(ИмяТипа));

КонецФункции // НовыйОбъектXDTO()

Функция ВнешнийТипXDTO(Прокси, ИмяТипа)
	
	Возврат Прокси.ФабрикаXDTO.Тип(ПространствоИмен(), ИмяТипа);

КонецФункции

Функция НовыйВнешнийОбъектXDTO(Прокси, ИмяТипа)
	
	ТипXDTO = ВнешнийТипXDTO(Прокси, ИмяТипа);
	
	Возврат Прокси.ФабрикаXDTO.Создать(ТипXDTO);

КонецФункции

#КонецОбласти

#Область ФункцииОбменаДляРегламентныхЗаданий

// Вызов операции GetActiveUsers. Таблица актуальных имен пользователей из Купорос
// 
// Возвращаемое значение:
//  ТаблицаЗначений - содержит колонки:
//		* Наименование - Строка
//		* УчетнаяЗаписьWindows - Строка
//		* ПользовательОС - Строка - Аутентификационная информация вида \\<домен>\<учетная запись>
//		* Email - Строка
//		* ДатаИзмененияКупорос - Дата
//		* Недействителен - Булево - Ложь, т.к. получаем актуальные данные
//		* ИД_Купорос - Строка - Идентификатор в 36 символов
//
Функция ЗагрузкаАктуальныхПользователейИзКупорос()
	
	ПараметрыПодключения = ПодключениеAccessControl();
	
	Прокси = ПараметрыПодключения.Прокси;
	ИД_ТекущейСистемы = ПараметрыПодключения.ИД_ТекущейСистемы;
	
    Результат = Прокси.GetActiveUsers(ИД_ТекущейСистемы);
	
	Если Результат = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Результат подключения к Купорос = Неопределено.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ВызватьИсключение ТекстСообщения;
    КонецЕсли;
	
	Если Результат.OperationResult.Error Тогда
		ТекстСообщения = НСтр("ru = 'Есть ошибки при получении результата от Купорос.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Наименование");
	ТаблицаРезультата.Колонки.Добавить("УчетнаяЗаписьWindows");
	ТаблицаРезультата.Колонки.Добавить("ПользовательОС");
	ТаблицаРезультата.Колонки.Добавить("Email");
	ТаблицаРезультата.Колонки.Добавить("ДатаИзмененияКупорос");
	ТаблицаРезультата.Колонки.Добавить("Недействителен");
	ТаблицаРезультата.Колонки.Добавить("ИД_Купорос");
	
	Для каждого ТекСтрока Из Результат.ActiveUser Цикл
	
		НоваяСтрока = ТаблицаРезультата.Добавить();	
		НоваяСтрока.Наименование = ТекСтрока.Name;
		НоваяСтрока.УчетнаяЗаписьWindows = ТекСтрока.AccountLogin;
		НоваяСтрока.ПользовательОС = ТекСтрока.UserOS;
		НоваяСтрока.Email = ТекСтрока.Email;
		НоваяСтрока.ДатаИзмененияКупорос = ТекСтрока.DataChange;
		НоваяСтрока.Недействителен = Ложь;
		НоваяСтрока.ИД_Купорос = ТекСтрока.ID_User;
		
	КонецЦикла;
	
	Возврат ТаблицаРезультата;	

КонецФункции

// Вызов операции PutAccessPatterns. Передача в Купорос актуальных шаблонов доступа из справочника КП_ШаблоныДоступаПользователей 
// 
// Возвращаемое значение:
//  Булево - Истина, в случае успешной передачи
//
Функция ВыгрузкаШаблоновДоступаВКупорос()

	ПараметрыПодключения = ПодключениеAccessControl();
	
	Прокси = ПараметрыПодключения.Прокси;
	ИД_ТекущейСистемы = ПараметрыПодключения.ИД_ТекущейСистемы;
	
	AccessPatterns = НовыйВнешнийОбъектXDTO(Прокси, "AccessPatterns");
	
	ТаблицаШаблонов = КП_УправлениеПравамиДоступа.ТаблицаАктуальныхШаблоновДоступа();	
	
	// Заполнение таблицы в объект XDTO
	ЗаполнениеAccessPatterns(ТаблицаШаблонов, Прокси, AccessPatterns);
	
	Результат = Прокси.PutAccessPatterns(ИД_ТекущейСистемы, AccessPatterns);
	
	Возврат Истина;

КонецФункции

Процедура ЗаполнениеAccessPatterns(ТаблицаШаблонов, Прокси, AccessPatterns)

	Для каждого ТекСтрока Из ТаблицаШаблонов Цикл
		
		AccessPattern  = НовыйВнешнийОбъектXDTO(Прокси, "AccessPattern");
		
		AccessPattern.ID_Pattern  = Строка(ТекСтрока.Ссылка.УникальныйИдентификатор()); 
		AccessPattern.Name 		  = ТекСтрока.Наименование; 
		AccessPattern.Description = ТекСтрока.ОписаниеГруппДоступа;
		AccessPattern.Comment 	  = ТекСтрока.Комментарий;
		
		AccessPatterns.AccessPattern.Добавить(AccessPattern);	
	
	КонецЦикла;
	
КонецПроцедуры 

// Вызов операции GetAccessRights. Формирование таблицы прав
Функция ЗагрузкаПравДоступаИзКупорос()

	ПараметрыПодключения = ПодключениеAccessControl();
	
	Прокси = ПараметрыПодключения.Прокси;
	ИД_ТекущейСистемы = ПараметрыПодключения.ИД_ТекущейСистемы;
		
	Результат = Прокси.GetAccessRights(ИД_ТекущейСистемы);
	
	Если Результат = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Результат подключения к Купорос = Неопределено.'"); 
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;

	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("ID_User");
	ТаблицаРезультата.Колонки.Добавить("ID_Pattern");
	ТаблицаРезультата.Колонки.Добавить("Comment");
	
	Для каждого ТекСтрока Из Результат.AccessRight Цикл
	
		НоваяСтрока = ТаблицаРезультата.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		
	КонецЦикла;
	
	Возврат ТаблицаРезультата;	
	
КонецФункции 


#КонецОбласти

#КонецОбласти
